read_verilog -sv ib.v ibsm.v fifo.v mkreq.v mkwe.v arb.v ackor.v cbsel.v cb.v sw.v # sv
read_liberty -lib ../osu018_stdcells.lib #lib
proc
#flatten
synth -auto-top
write_verilog synth0.v
dfflibmap -liberty ../osu018_stdcells.lib
abc -D 5000 -liberty ../osu018_stdcells.lib
stat -liberty ../osu018_stdcells.lib
write_verilog gatesw.v
show -viewer gvedit # for windows user
